* Org Mode Basics
[[https://orgmode.org/manual/index.html][Org Mode Manual]] \\
[[https://orgmode.org/worg/orgcard.html][Org Mode Reference Card]]
** Key Bindings sub-section
- *SHIFT + TAB*: Collapses and cycles through headings
- *CTRL + RET*: Insert new header item
- *ALT + RET*: Create new item at same level
- *ALT + UP/DOWN ARROW*: Moves items up/down
- *SHIFT + ALT + UP/DOWN ARROW*: Promote item
- *CTRL-C CTRL-L* (C-c C-l): Org Mode insert link
- *CTRL-C CTRL-O* (C-c C-o): Open link at cursor
- *CTRL-C CTRL-C* (C-c C-c): Run code block

** Rich-text Editing
  - *bold*: through star (*) characters
  - _underline_: through the underscore (_) characters
  - /italics/: through the slash (/) characters
  - ~code~: through the tilda (~) characters
  - =verbatim=: through the equal (=) characters (used for quoting)
  - table: uses pipe (|) to construct. TAB for auto-formatting
  - [X] checklist: use square brackets (C-c C-x C-b)

** Source blocks
Code blocks can be embedded and ran

Using hash (*#*) and plus (*+*) with /BEGIN/END_SRC/ and lang.
/emacs lisp Example/:
#+BEGIN_SRC emacs-lisp :results output
  (defun elisp-hello()
      (message "Hello!"))
  (elisp-hello)
#+END_SRC

#+BEGIN_SRC python :results output
  print('Hello World of Org')
#+END_SRC

#+RESULTS:
: Hello World of Org

* TODO TO-DO List
A header can be set as a todo item
- /org-todo/ command will set the header to *DONE*
- /Note/: *SHIFT + LEFT/RIGHT ARROW* can switch the status

* DONE Finished List
CLOSED: [2025-05-24 Sat 22:37]
